---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarHookType
source: html/4673f540-13ca-c07b-65ee-d38635173f26.htm
---
# RebarHookType Properties

The id of the assembly instance to which the element belongs.